CSI API ETABS v1
cPropMaterial.TimeDep Property
 API calls for time dependent material properties.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cPropMaterialTD TimeDep { get; }
ReadOnly Property TimeDep As cPropMaterialTD
	Get
Dim instance As cPropMaterial
Dim value As cPropMaterialTD
value = instance.TimeDep
property cPropMaterialTD^ TimeDep {
	cPropMaterialTD^ get ();
}
abstract TimeDep : cPropMaterialTD with get
Property Value
Type: cPropMaterialTD
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace